app/controllers/posts_controller.rb

    def index
        @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

    def create
        @post = Post.new(posts_params)

        if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdfsdf"], ["content", "sdfsdf"], ["created_at", "2017-05-13 17:50:28.995257"], ["updated_at", "2017-05-13 17:50:28.995257"]]

    def update
        if @post.update(posts_params)
---
UPDATE "posts" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_updated_at", "2017-05-13 19:30:27.051505"], ["image_file_name", "안전망.jpg"], ["updated_at", "2017-05-13 19:30:27.589219"], ["id", 1]]